read_verilog -formal spm.v
hierarchy -check -top spm
prep
async2sync
opt_clean
check -initdrv
setundef -undriven -undef
write_ilang spm/gold.il
