[options]
mode prove
depth 2
expect pass,fail,unknown,timeout


[engines]
smtbmc bitwuzla

[script]
verilog_defaults -add -D CHECK_OUTPUTS
read_verilog -sv ../../../../../partitions/spm.csa0.hsum2.sv
read_ilang ../../../../../partitions/spm.csa0.hsum2.il
hierarchy -top miter; proc

async2sync
formalff -clk2ff -ff2anyinit gate.spm.csa0.hsum2
setundef -anyseq gate.spm.csa0.hsum2
flatten -wb; dffunmap; opt_expr -keepdc -undriven; opt_clean
xprop -formal -split-ports -assume-def-inputs miter

