verilog_defaults -add -D CHECK_OUTPUTS
read_verilog -sv ../../../partitions/spm.genblk1.26.csa.y.sv
read_ilang ../../../partitions/spm.genblk1.26.csa.y.il
hierarchy -top miter; proc; chformal -cover -remove
async2sync
formalff -clk2ff -ff2anyinit gate.spm.genblk1.26.csa.y
setundef -anyseq gate.spm.genblk1.26.csa.y
flatten -wb; dffunmap; opt_expr -keepdc -undriven; opt_clean
sat -tempinduct -set-init-undef -set-def-formal -set-def-inputs -maxsteps 2 -set-assumes -prove-asserts -show-public -dump_vcd trace.vcd miter
